Revit 2024 API
Tile Members
The Tile type exposes the following members.
Properties
Name | Description
TextureLinkTextureTransforms
 The property labeled "Link Transforms" from the "Tile" schema.
TextureOffsetLock
 The property labeled "Offset Lock" from the "Tile" schema.
TextureRealWorldOffsetX
 The property labeled "Offset X" from the "Tile" schema.
TextureRealWorldOffsetY
 The property labeled "Offset Y" from the "Tile" schema.
TextureRealWorldScaleX
 The property labeled "Size X" from the "Tile" schema.
TextureRealWorldScaleY
 The property labeled "Size Y" from the "Tile" schema.
TextureScaleLock
 The property labeled "Scale Lock" from the "Tile" schema.
TextureURepeat
 The property labeled "U Repeat" from the "Tile" schema.
TextureVRepeat
 The property labeled "V Repeat" from the "Tile" schema.
TextureWAngle
 The property labeled "Angle" from the "Tile" schema.
TileBrickColor
 The property labeled "Tile Color" from the "Tile" schema.
TileBrickType
 The property labeled "Type" from the "Tile" schema.
TileChangeColumn
 The property labeled "Amount" from the "Tile" schema.
TileChangeRow
 The property labeled "Amount" from the "Tile" schema.
TileColorVariance
 The property labeled "Color Variance" from the "Tile" schema.
TileEdgeRoughness
 The property labeled "Roughness" from the "Tile" schema.
TileFadeVariance
 The property labeled "Fade Variance" from the "Tile" schema.
TileHorizontalCount
 The property labeled "Tile Count" from the "Tile" schema.
TileHorizontalGap
 The property labeled "Gap Width" from the "Tile" schema.
TileLineShift
 The property labeled "Line Shift" from the "Tile" schema.
TileMortarColor
 The property labeled "Grout Color" from the "Tile" schema.
TilePerColumn
 The property labeled "Every" from the "Tile" schema.
TilePerRow
 The property labeled "Every" from the "Tile" schema.
TileRandomSeed
 The property labeled "Randomize" from the "Tile" schema.
TileRandomShift
 The property labeled "Random" from the "Tile" schema.
TileUseColumnEdit
 The property labeled "Column Modify" from the "Tile" schema.
TileUseRowEdit
 The property labeled "Row Modify" from the "Tile" schema.
TileVerticalCount
 The property labeled "tile_VerticalCount" from the "Tile" schema.
TileVerticalGap
 The property labeled "Vert" from the "Tile" schema.
See Also
Tile Class
Autodesk.Revit.DB.Visual Namespace